spot/doc/userdoc/tut21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Custom print of an automaton</title>
<!-- 2018-01-20 Sat 14:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<meta  name="description" content="Code example for iterating over ω-automata in Spot"
 />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="spot.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="tut.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Custom print of an automaton</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">C++</a></li>
<li><a href="#sec-2">Python</a></li>
</ul>
</div>
</div>
<p>
This example demonstrates how to iterate over an automaton in C++ and
Python.  This case uses automata stored entirely in memory as a graph:
states are numbered by integers, and transitions can be seen as tuples
of the form
\((\mathit{src},\mathit{dst},\mathit{cond},\mathit{accsets})\) where
\(\mathit{src}\) and \(\mathit{dst}\) are integers denoting the source and
destination states, \(\mathit{cond}\) is a BDD representing the label
(a.k.a. guard), and \(\mathit{accsets}\) is an object of type
<code>acc_cond::mark_t</code> encoding the membership to each acceptance sets
(<code>acc_cond::mark_t</code> is basically a bit vector).
</p>

<p>
The interface available for those graph-based automata allows random
access to any state of the graph, hence the code given bellow can do a
simple loop over all states of the automaton.  Spot also supports a
different kind of interface (not demonstrated here) to
<a href="tut50.html">iterate over automata that are constructed
on-the-fly</a> and where such a loop would be impossible.
</p>

<p>
First let's create an example automaton in HOA format.  We use <code>-U</code> to
request unambiguous automata, as this allows us to demonstrate how
property bits are used.
</p>

<div class="org-src-container">

<pre class="src src-sh">ltl2tgba -U <span class="org-string">'Fa | G(Fb&amp;Fc)'</span> | tee tut21.hoa
</pre>
</div>
<div class="org-src-container">

<pre class="src src-hoa"><span class="org-hoa-header-uppercase">HOA:</span> v1
<span class="org-hoa-header-lowercase">name:</span> <span class="org-string">"F(a | G(Fb &amp; Fc))"</span>
<span class="org-hoa-header-uppercase">States:</span> 17
<span class="org-hoa-header-uppercase">Start:</span> 0
<span class="org-hoa-header-uppercase">AP:</span> 3 <span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span>
<span class="org-hoa-header-lowercase">acc-name:</span> generalized-Buchi 2
<span class="org-hoa-header-uppercase">Acceptance:</span> 2 <span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">0</span>)&amp;<span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">1</span>)
<span class="org-hoa-header-lowercase">properties:</span> trans-labels explicit-labels trans-acc unambiguous
<span class="org-hoa-header-lowercase">properties:</span> stutter-invariant
<span class="org-hoa-keyword">--BODY--</span>
<span class="org-hoa-header-uppercase">State:</span> 0
[<span class="org-hoa-ap-number">0</span>] 1
[!<span class="org-hoa-ap-number">0</span>] 2
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 3
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 4
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 5
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 6
<span class="org-hoa-header-uppercase">State:</span> 1
[<span class="org-hoa-builtin">t</span>] 1 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-header-uppercase">State:</span> 2
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 2
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 2 {<span class="org-hoa-acceptance-set">1</span>}
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 2 {<span class="org-hoa-acceptance-set">0</span>}
[<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 2 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-header-uppercase">State:</span> 3
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 3
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 4
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 5
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 6
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 8
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 13
<span class="org-hoa-header-uppercase">State:</span> 4
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 3
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 4
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 5
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 6
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>] 8
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 14
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 15
<span class="org-hoa-header-uppercase">State:</span> 5
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 3
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 4
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 5
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 8
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 13
<span class="org-hoa-header-uppercase">State:</span> 6
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 6
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
<span class="org-hoa-header-uppercase">State:</span> 7
[!<span class="org-hoa-ap-number">2</span>] 7 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-header-uppercase">State:</span> 8
[!<span class="org-hoa-ap-number">1</span>] 8 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-header-uppercase">State:</span> 9
[!<span class="org-hoa-ap-number">2</span>] 7
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 8
[<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 13
<span class="org-hoa-header-uppercase">State:</span> 10
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
[<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 14
<span class="org-hoa-header-uppercase">State:</span> 11
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 8
[<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 13
<span class="org-hoa-header-uppercase">State:</span> 12
[<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 9
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 10
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 11
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 12
<span class="org-hoa-header-uppercase">State:</span> 13
[!<span class="org-hoa-ap-number">1</span>&amp;<span class="org-hoa-ap-number">2</span>] 8
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 13
<span class="org-hoa-header-uppercase">State:</span> 14
[<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 14
<span class="org-hoa-header-uppercase">State:</span> 15
[!<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 6
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 7
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 14
[!<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 15
[<span class="org-hoa-ap-number">0</span>&amp;!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 16
<span class="org-hoa-header-uppercase">State:</span> 16
[!<span class="org-hoa-ap-number">1</span>&amp;!<span class="org-hoa-ap-number">2</span>] 16 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-keyword">--END--</span>
</pre>
</div>
