spot/doc/userdoc/tut21.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">C++</h2>
<div class="outline-text-2" id="text-1">
<p>
We now write some C++ to load this automaton <a href="tut20.html">as we did before</a>, and in
<code>custom_print()</code> we print it out in a custom way by explicitly
iterating over its states and edges.
</p>

<p>
The only tricky part is to print the edge labels.  Since they are
BDDs, printing them directly would just show the identifiers of BDDs
involved.  Using <code>bdd_print_formula</code> and passing it the BDD dictionary
associated to the automaton is one way to print the edge labels.
</p>

<p>
Each automaton stores a vector the atomic propositions it uses.  You
can iterate on that vector using the <code>ap()</code> member function.  If you
want to convert an atomic proposition (represented by a <code>formula</code>)
into a BDD, use the <code>bdd_dict::varnum()</code> method to obtain the
corresponding BDD variable number, and then use for instance
<code>bdd_ithvar()</code> to convert this BDD variable number into an actual BDD.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/parseaut/public.hh&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twaalgos/hoa.hh&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twa/bddprint.hh&gt;</span>

<span class="org-type">void</span> <span class="org-function-name">custom_print</span>(<span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-variable-name">out</span>, <span class="org-constant">spot</span>::<span class="org-variable-name">twa_graph_ptr</span>&amp; aut);

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-constant">spot</span>::<span class="org-type">parsed_aut_ptr</span> <span class="org-variable-name">pa</span> = parse_aut(<span class="org-string">"tut21.hoa"</span>, <span class="org-constant">spot</span>::make_bdd_dict());
  <span class="org-keyword">if</span> (pa-&gt;format_errors(<span class="org-constant">std</span>::cerr))
    <span class="org-keyword">return</span> 1;
  <span class="org-comment-delimiter">// </span><span class="org-comment">This cannot occur when reading a never claim, but</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">it could while reading a HOA file.</span>
  <span class="org-keyword">if</span> (pa-&gt;aborted)
    {
      <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">"--ABORT-- read\n"</span>;
      <span class="org-keyword">return</span> 1;
    }
  custom_print(<span class="org-constant">std</span>::cout, pa-&gt;aut);
}

<span class="org-type">void</span> <span class="org-function-name">custom_print</span>(<span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-variable-name">out</span>, <span class="org-constant">spot</span>::<span class="org-variable-name">twa_graph_ptr</span>&amp; aut)
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">We need the dictionary to print the BDDs that label the edges</span>
  <span class="org-keyword">const</span> <span class="org-constant">spot</span>::<span class="org-type">bdd_dict_ptr</span>&amp; <span class="org-variable-name">dict</span> = aut-&gt;get_dict();

  <span class="org-comment-delimiter">// </span><span class="org-comment">Some meta-data...</span>
  out &lt;&lt; <span class="org-string">"Acceptance: "</span> &lt;&lt; aut-&gt;get_acceptance() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Number of sets: "</span> &lt;&lt; aut-&gt;num_sets() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Number of states: "</span> &lt;&lt; aut-&gt;num_states() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Number of edges: "</span> &lt;&lt; aut-&gt;num_edges() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Initial state: "</span> &lt;&lt; aut-&gt;get_init_state_number() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Atomic propositions:"</span>;
  <span class="org-keyword">for</span> (<span class="org-constant">spot</span>::<span class="org-type">formula</span> <span class="org-variable-name">ap</span>: aut-&gt;ap())
      out &lt;&lt; <span class="org-string">' '</span> &lt;&lt; ap &lt;&lt; <span class="org-string">" (="</span> &lt;&lt; dict-&gt;varnum(ap) &lt;&lt; <span class="org-string">')'</span>;
  out &lt;&lt; <span class="org-string">'\n'</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">Arbitrary data can be attached to automata, by giving them</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">a type and a name.  The HOA parser and printer both use the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">"automaton-name" to name the automaton.</span>
  <span class="org-keyword">if</span> (<span class="org-keyword">auto</span> <span class="org-type">name</span> = aut-&gt;<span class="org-type">get_named_prop</span>&lt;<span class="org-constant">std</span>::string&gt;(<span class="org-string">"automaton-name"</span>))
     out &lt;&lt; <span class="org-string">"Name: "</span> &lt;&lt; *name &lt;&lt; <span class="org-string">'\n'</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">For the following prop_*() methods, the return value is an</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">instance of the spot::trival class that can represent</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">yes/maybe/no.  These properties correspond to bits stored in the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">automaton, so they can be queried in constant time.  They are</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">only set whenever they can be determined at a cheap cost: for</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">instance an algorithm that always produces deterministic automata</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">would set the deterministic property on its output.  In this</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">example, the properties that are set come from the "properties:"</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">line of the input file.</span>
  out &lt;&lt; <span class="org-string">"Complete: "</span> &lt;&lt; aut-&gt;prop_complete() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Deterministic: "</span> &lt;&lt; (aut-&gt;prop_universal()
                               &amp;&amp; aut-&gt;is_existential()) &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Unambiguous: "</span> &lt;&lt; aut-&gt;prop_unambiguous() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"State-Based Acc: "</span> &lt;&lt; aut-&gt;prop_state_acc() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Terminal: "</span> &lt;&lt; aut-&gt;prop_terminal() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Weak: "</span> &lt;&lt; aut-&gt;prop_weak() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Inherently Weak: "</span> &lt;&lt; aut-&gt;prop_inherently_weak() &lt;&lt; <span class="org-string">'\n'</span>;
  out &lt;&lt; <span class="org-string">"Stutter Invariant: "</span> &lt;&lt; aut-&gt;prop_stutter_invariant() &lt;&lt; <span class="org-string">'\n'</span>;

  <span class="org-comment-delimiter">// </span><span class="org-comment">States are numbered from 0 to n-1</span>
  <span class="org-type">unsigned</span> <span class="org-variable-name">n</span> = aut-&gt;num_states();
  <span class="org-keyword">for</span> (<span class="org-type">unsigned</span> <span class="org-variable-name">s</span> = 0; s &lt; n; ++s)
    {
      out &lt;&lt; <span class="org-string">"State "</span> &lt;&lt; s &lt;&lt; <span class="org-string">":\n"</span>;

      <span class="org-comment-delimiter">// </span><span class="org-comment">The out(s) method returns a fake container that can be</span>
      <span class="org-comment-delimiter">// </span><span class="org-comment">iterated over as if the contents was the edges going</span>
      <span class="org-comment-delimiter">// </span><span class="org-comment">out of s.  Each of these edges is a quadruplet</span>
      <span class="org-comment-delimiter">// </span><span class="org-comment">(src,dst,cond,acc).  Note that because this returns</span>
      <span class="org-comment-delimiter">// </span><span class="org-comment">a reference, the edge can also be modified.</span>
      <span class="org-keyword">for</span> (<span class="org-keyword">auto</span>&amp; <span class="org-variable-name">t</span>: aut-&gt;out(s))
        {
          out &lt;&lt; <span class="org-string">"  edge("</span> &lt;&lt; t.src &lt;&lt; <span class="org-string">" -&gt; "</span> &lt;&lt; t.dst &lt;&lt; <span class="org-string">")\n    label = "</span>;
          <span class="org-constant">spot</span>::bdd_print_formula(out, dict, t.cond);
          out &lt;&lt; <span class="org-string">"\n    acc sets = "</span> &lt;&lt; t.acc &lt;&lt; <span class="org-string">'\n'</span>;
        }
    }
}
</pre>
</div>

<pre class="example">
