spot/doc/org/tut21.org
* Python

Here is the very same example, but written in Python:

#+BEGIN_SRC python :results output :exports both
  import spot


  def custom_print(aut):
      bdict = aut.get_dict()
      print("Acceptance:", aut.get_acceptance())
      print("Number of sets:", aut.num_sets())
      print("Number of states: ", aut.num_states())
      print("Initial states: ", aut.get_init_state_number())
      print("Atomic propositions:", end='')
      for ap in aut.ap():
          print(' ', ap, ' (=', bdict.varnum(ap), ')', sep='', end='')
      print()
      # Templated methods are not available in Python, so we cannot
      # retrieve/attach arbitrary objects from/to the automaton.  However the
      # Python bindings have get_name() and set_name() to access the
      # "automaton-name" property.
      name = aut.get_name()
      if name:
          print("Name: ", name)
      print("Deterministic:", aut.prop_universal() and aut.is_existential())
      print("Unambiguous:", aut.prop_unambiguous())
      print("State-Based Acc:", aut.prop_state_acc())
      print("Terminal:", aut.prop_terminal())
      print("Weak:", aut.prop_weak())
      print("Inherently Weak:", aut.prop_inherently_weak())
      print("Stutter Invariant:", aut.prop_stutter_invariant())

      for s in range(0, aut.num_states()):
          print("State {}:".format(s))
          for t in aut.out(s):
              print("  edge({} -> {})".format(t.src, t.dst))
              # bdd_print_formula() is designed to print on a std::ostream, and
              # is inconveniant to use in Python.  Instead we use
              # bdd_format_formula() as this simply returns a string.
              print("    label =", spot.bdd_format_formula(bdict, t.cond))
              print("    acc sets =", t.acc)


  custom_print(spot.automaton("tut21.hoa"))
#+END_SRC

#+RESULTS:
#+begin_example
Acceptance: Inf(0)&Inf(1)
Number of sets: 2
Number of states:  4
Initial states:  0
Atomic propositions: a (=0) b (=1) c (=2)
Name:  Fa | G(Fb & Fc)
Deterministic: no
Unambiguous: maybe
State-Based Acc: maybe
Terminal: maybe
Weak: maybe
Inherently Weak: maybe
Stutter Invariant: yes
State 0:
  edge(0 -> 1)
    label = a
    acc sets = {}
  edge(0 -> 2)
    label = !a
    acc sets = {}
  edge(0 -> 3)
    label = !a
    acc sets = {}
State 1:
  edge(1 -> 1)
    label = 1
    acc sets = {0,1}
State 2:
  edge(2 -> 1)
    label = a
    acc sets = {}
  edge(2 -> 2)
    label = !a
    acc sets = {}
State 3:
  edge(3 -> 3)
    label = !a & b & c
    acc sets = {0,1}
  edge(3 -> 3)
    label = !a & !b & c
    acc sets = {1}
  edge(3 -> 3)
    label = !a & b & !c
    acc sets = {0}
  edge(3 -> 3)
    label = !a & !b & !c
    acc sets = {}
#+end_example


#+BEGIN_SRC sh :results silent :exports results
rm -f tut21.hoa
#+END_SRC
