spot/doc/userdoc/tut21.html
Acceptance: Inf(0)&amp;Inf(1)
Number of sets: 2
Number of states: 17
Number of edges: 80
Initial state: 0
Atomic propositions: a (=0) b (=1) c (=2)
Name: F(a | G(Fb &amp; Fc))
Complete: no
Deterministic: no
Unambiguous: yes
State-Based Acc: maybe
Terminal: maybe
Weak: maybe
Inherently Weak: maybe
Stutter Invariant: yes
State 0:
  edge(0 -&gt; 1)
    label = a
    acc sets = {}
  edge(0 -&gt; 2)
    label = !a
    acc sets = {}
  edge(0 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(0 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(0 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(0 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
State 1:
  edge(1 -&gt; 1)
    label = 1
    acc sets = {0,1}
State 2:
  edge(2 -&gt; 2)
    label = !b &amp; !c
    acc sets = {}
  edge(2 -&gt; 2)
    label = !b &amp; c
    acc sets = {1}
  edge(2 -&gt; 2)
    label = b &amp; !c
    acc sets = {0}
  edge(2 -&gt; 2)
    label = b &amp; c
    acc sets = {0,1}
State 3:
  edge(3 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(3 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(3 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
  edge(3 -&gt; 7)
    label = a &amp; !c
    acc sets = {}
  edge(3 -&gt; 8)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(3 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(3 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(3 -&gt; 13)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 4:
  edge(4 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(4 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(4 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(4 -&gt; 6)
    label = !a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 7)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 8)
    label = a &amp; !b
    acc sets = {}
  edge(4 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(4 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(4 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(4 -&gt; 14)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(4 -&gt; 15)
    label = !a &amp; !b &amp; !c
    acc sets = {}
State 5:
  edge(5 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(5 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(5 -&gt; 8)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(5 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(5 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(5 -&gt; 13)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 6:
  edge(6 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
  edge(6 -&gt; 7)
    label = a &amp; !c
    acc sets = {}
State 7:
  edge(7 -&gt; 7)
    label = !c
    acc sets = {0,1}
State 8:
  edge(8 -&gt; 8)
    label = !b
    acc sets = {0,1}
State 9:
  edge(9 -&gt; 7)
    label = !c
    acc sets = {}
  edge(9 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(9 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(9 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(9 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(9 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(9 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 10:
  edge(10 -&gt; 7)
    label = b &amp; !c
    acc sets = {}
  edge(10 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(10 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(10 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(10 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(10 -&gt; 14)
    label = !b &amp; !c
    acc sets = {}
State 11:
  edge(11 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(11 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(11 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(11 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(11 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(11 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 12:
  edge(12 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(12 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(12 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(12 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
State 13:
  edge(13 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(13 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 14:
  edge(14 -&gt; 7)
    label = b &amp; !c
    acc sets = {}
  edge(14 -&gt; 14)
    label = !b &amp; !c
    acc sets = {}
State 15:
  edge(15 -&gt; 6)
    label = !a &amp; b &amp; !c
    acc sets = {}
  edge(15 -&gt; 7)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(15 -&gt; 14)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(15 -&gt; 15)
    label = !a &amp; !b &amp; !c
    acc sets = {}
  edge(15 -&gt; 16)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 16:
  edge(16 -&gt; 16)
    label = !b &amp; !c
    acc sets = {0,1}
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Python</h2>
<div class="outline-text-2" id="text-2">
<p>
Here is the very same example, but written in Python:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> spot


<span class="org-keyword">def</span> <span class="org-function-name">custom_print</span>(aut):
    <span class="org-variable-name">bdict</span> = aut.get_dict()
    <span class="org-keyword">print</span>(<span class="org-string">"Acceptance:"</span>, aut.get_acceptance())
    <span class="org-keyword">print</span>(<span class="org-string">"Number of sets:"</span>, aut.num_sets())
    <span class="org-keyword">print</span>(<span class="org-string">"Number of states: "</span>, aut.num_states())
    <span class="org-keyword">print</span>(<span class="org-string">"Initial states: "</span>, aut.get_init_state_number())
    <span class="org-keyword">print</span>(<span class="org-string">"Atomic propositions:"</span>, end=<span class="org-string">''</span>)
    <span class="org-keyword">for</span> ap <span class="org-keyword">in</span> aut.ap():
        <span class="org-keyword">print</span>(<span class="org-string">' '</span>, ap, <span class="org-string">' (='</span>, bdict.varnum(ap), <span class="org-string">')'</span>, sep=<span class="org-string">''</span>, end=<span class="org-string">''</span>)
    <span class="org-keyword">print</span>()
    <span class="org-comment-delimiter"># </span><span class="org-comment">Templated methods are not available in Python, so we cannot</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">retrieve/attach arbitrary objects from/to the automaton.  However the</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Python bindings have get_name() and set_name() to access the</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">"automaton-name" property.</span>
    <span class="org-variable-name">name</span> = aut.get_name()
    <span class="org-keyword">if</span> name:
        <span class="org-keyword">print</span>(<span class="org-string">"Name: "</span>, name)
    <span class="org-keyword">print</span>(<span class="org-string">"Deterministic:"</span>, aut.prop_universal() <span class="org-keyword">and</span> aut.is_existential())
    <span class="org-keyword">print</span>(<span class="org-string">"Unambiguous:"</span>, aut.prop_unambiguous())
    <span class="org-keyword">print</span>(<span class="org-string">"State-Based Acc:"</span>, aut.prop_state_acc())
    <span class="org-keyword">print</span>(<span class="org-string">"Terminal:"</span>, aut.prop_terminal())
    <span class="org-keyword">print</span>(<span class="org-string">"Weak:"</span>, aut.prop_weak())
    <span class="org-keyword">print</span>(<span class="org-string">"Inherently Weak:"</span>, aut.prop_inherently_weak())
    <span class="org-keyword">print</span>(<span class="org-string">"Stutter Invariant:"</span>, aut.prop_stutter_invariant())

    <span class="org-keyword">for</span> s <span class="org-keyword">in</span> <span class="org-builtin">range</span>(0, aut.num_states()):
        <span class="org-keyword">print</span>(<span class="org-string">"State {}:"</span>.<span class="org-builtin">format</span>(s))
        <span class="org-keyword">for</span> t <span class="org-keyword">in</span> aut.out(s):
            <span class="org-keyword">print</span>(<span class="org-string">"  edge({} -&gt; {})"</span>.<span class="org-builtin">format</span>(t.src, t.dst))
            <span class="org-comment-delimiter"># </span><span class="org-comment">bdd_print_formula() is designed to print on a std::ostream, and</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">is inconveniant to use in Python.  Instead we use</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">bdd_format_formula() as this simply returns a string.</span>
            <span class="org-keyword">print</span>(<span class="org-string">"    label ="</span>, spot.bdd_format_formula(bdict, t.cond))
            <span class="org-keyword">print</span>(<span class="org-string">"    acc sets ="</span>, t.acc)


custom_print(spot.automaton(<span class="org-string">"tut21.hoa"</span>))
</pre>
</div>

<pre class="example">
Acceptance: Inf(0)&amp;Inf(1)
Number of sets: 2
Number of states:  17
Initial states:  0
Atomic propositions: a (=0) b (=1) c (=2)
Name:  F(a | G(Fb &amp; Fc))
Deterministic: no
Unambiguous: yes
State-Based Acc: maybe
Terminal: maybe
Weak: maybe
Inherently Weak: maybe
Stutter Invariant: yes
State 0:
  edge(0 -&gt; 1)
    label = a
    acc sets = {}
  edge(0 -&gt; 2)
    label = !a
    acc sets = {}
  edge(0 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(0 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(0 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(0 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
State 1:
  edge(1 -&gt; 1)
    label = 1
    acc sets = {0,1}
State 2:
  edge(2 -&gt; 2)
    label = !b &amp; !c
    acc sets = {}
  edge(2 -&gt; 2)
    label = !b &amp; c
    acc sets = {1}
  edge(2 -&gt; 2)
    label = b &amp; !c
    acc sets = {0}
  edge(2 -&gt; 2)
    label = b &amp; c
    acc sets = {0,1}
State 3:
  edge(3 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(3 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(3 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
  edge(3 -&gt; 7)
    label = a &amp; !c
    acc sets = {}
  edge(3 -&gt; 8)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(3 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(3 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(3 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(3 -&gt; 13)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 4:
  edge(4 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(4 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(4 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(4 -&gt; 6)
    label = !a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 7)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 8)
    label = a &amp; !b
    acc sets = {}
  edge(4 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(4 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(4 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(4 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(4 -&gt; 14)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(4 -&gt; 15)
    label = !a &amp; !b &amp; !c
    acc sets = {}
State 5:
  edge(5 -&gt; 3)
    label = !a &amp; b &amp; c
    acc sets = {}
  edge(5 -&gt; 4)
    label = !a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 5)
    label = !a &amp; !c
    acc sets = {}
  edge(5 -&gt; 8)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 9)
    label = a &amp; b &amp; c
    acc sets = {}
  edge(5 -&gt; 10)
    label = a &amp; !b &amp; c
    acc sets = {}
  edge(5 -&gt; 11)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(5 -&gt; 12)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(5 -&gt; 13)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 6:
  edge(6 -&gt; 6)
    label = !a &amp; !c
    acc sets = {}
  edge(6 -&gt; 7)
    label = a &amp; !c
    acc sets = {}
State 7:
  edge(7 -&gt; 7)
    label = !c
    acc sets = {0,1}
State 8:
  edge(8 -&gt; 8)
    label = !b
    acc sets = {0,1}
State 9:
  edge(9 -&gt; 7)
    label = !c
    acc sets = {}
  edge(9 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(9 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(9 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(9 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(9 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(9 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 10:
  edge(10 -&gt; 7)
    label = b &amp; !c
    acc sets = {}
  edge(10 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(10 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(10 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(10 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(10 -&gt; 14)
    label = !b &amp; !c
    acc sets = {}
State 11:
  edge(11 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(11 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(11 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(11 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(11 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
  edge(11 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 12:
  edge(12 -&gt; 9)
    label = b &amp; c
    acc sets = {}
  edge(12 -&gt; 10)
    label = !b &amp; c
    acc sets = {}
  edge(12 -&gt; 11)
    label = b &amp; !c
    acc sets = {}
  edge(12 -&gt; 12)
    label = !b &amp; !c
    acc sets = {}
State 13:
  edge(13 -&gt; 8)
    label = !b &amp; c
    acc sets = {}
  edge(13 -&gt; 13)
    label = !b &amp; !c
    acc sets = {}
State 14:
  edge(14 -&gt; 7)
    label = b &amp; !c
    acc sets = {}
  edge(14 -&gt; 14)
    label = !b &amp; !c
    acc sets = {}
State 15:
  edge(15 -&gt; 6)
    label = !a &amp; b &amp; !c
    acc sets = {}
  edge(15 -&gt; 7)
    label = a &amp; b &amp; !c
    acc sets = {}
  edge(15 -&gt; 14)
    label = a &amp; !b &amp; !c
    acc sets = {}
  edge(15 -&gt; 15)
    label = !a &amp; !b &amp; !c
    acc sets = {}
  edge(15 -&gt; 16)
    label = a &amp; !b &amp; !c
    acc sets = {}
State 16:
  edge(16 -&gt; 16)
    label = !b &amp; !c
    acc sets = {0,1}
</pre>
</div>
</div>
</div>
</body>
</html>
